-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Июн 27 2017 г., 17:17
-- Версия сервера: 5.7.15-log
-- Версия PHP: 5.6.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_shop1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cart`
--

CREATE TABLE `cart` (
  `id_cart` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `ord_flag` tinyint(1) NOT NULL DEFAULT '0',
  `date_ord` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `cart`
--

INSERT INTO `cart` (`id_cart`, `id_user`, `ord_flag`, `date_ord`) VALUES
(7, 1, 0, NULL),
(9, 2, 0, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `catalog`
--

CREATE TABLE `catalog` (
  `id_c` int(11) NOT NULL,
  `name` varchar(40) NOT NULL,
  `price` int(11) NOT NULL,
  `par1` varchar(128) DEFAULT NULL,
  `par2` varchar(128) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `catalog`
--

INSERT INTO `catalog` (`id_c`, `name`, `price`, `par1`, `par2`) VALUES
(1, 'Спички 1', 525, 'Параметр 1 для товара 1', 'Параметр 2 для товара 1'),
(2, 'Спички 2', 38, 'Параметр 1 для товара 2', 'Параметр 2 для товара 2'),
(3, 'Спички 3', 740, 'Параметр 1 для товара 3', 'Параметр 2 для товара 3'),
(4, 'Спички 4', 231, 'Параметр 1 для товара 4', 'Параметр 2 для товара 4'),
(5, 'Спички 5', 886, 'Параметр 1 для товара 5', 'Параметр 2 для товара 5'),
(6, 'Спички 6', 169, 'Параметр 1 для товара 6', 'Параметр 2 для товара 6'),
(7, 'Спички 7', 553, 'Параметр 1 для товара 7', 'Параметр 2 для товара 7'),
(8, 'Спички 8', 146, 'Параметр 1 для товара 8', 'Параметр 2 для товара 8'),
(9, 'Спички 9', 674, 'Параметр 1 для товара 9', 'Параметр 2 для товара 9'),
(10, 'Спички 10', 923, 'Параметр 1 для товара 10', 'Параметр 2 для товара 10'),
(11, 'Спички 11', 278, 'Параметр 1 для товара 11', 'Параметр 2 для товара 11'),
(12, 'Спички 12', 481, 'Параметр 1 для товара 12', 'Параметр 2 для товара 12'),
(13, 'Спички 13', 234, 'Параметр 1 для товара 13', 'Параметр 2 для товара 13'),
(14, 'Спички 14', 768, 'Параметр 1 для товара 14', 'Параметр 2 для товара 14'),
(15, 'Спички 15', 8, 'Параметр 1 для товара 15', 'Параметр 2 для товара 15'),
(16, 'Спички 16', 454, 'Параметр 1 для товара 16', 'Параметр 2 для товара 16'),
(17, 'Спички 17', 409, 'Параметр 1 для товара 17', 'Параметр 2 для товара 17'),
(18, 'Спички 18', 675, 'Параметр 1 для товара 18', 'Параметр 2 для товара 18'),
(19, 'Спички 19', 339, 'Параметр 1 для товара 19', 'Параметр 2 для товара 19'),
(20, 'Спички 20', 785, 'Параметр 1 для товара 20', 'Параметр 2 для товара 20'),
(21, 'Карандаш 21', 547, 'Параметр 1 для товара 21', 'Параметр 2 для товара 21'),
(22, 'Карандаш 22', 444, 'Параметр 1 для товара 22', 'Параметр 2 для товара 22'),
(23, 'Карандаш 23', 27, 'Параметр 1 для товара 23', 'Параметр 2 для товара 23'),
(24, 'Карандаш 24', 491, 'Параметр 1 для товара 24', 'Параметр 2 для товара 24'),
(25, 'Карандаш 25', 714, 'Параметр 1 для товара 25', 'Параметр 2 для товара 25'),
(26, 'Карандаш 26', 301, 'Параметр 1 для товара 26', 'Параметр 2 для товара 26'),
(27, 'Карандаш 27', 839, 'Параметр 1 для товара 27', 'Параметр 2 для товара 27'),
(28, 'Карандаш 28', 996, 'Параметр 1 для товара 28', 'Параметр 2 для товара 28'),
(29, 'Карандаш 29', 599, 'Параметр 1 для товара 29', 'Параметр 2 для товара 29'),
(30, 'Карандаш 30', 290, 'Параметр 1 для товара 30', 'Параметр 2 для товара 30'),
(31, 'Карандаш 31', 914, 'Параметр 1 для товара 31', 'Параметр 2 для товара 31'),
(32, 'Карандаш 32', 242, 'Параметр 1 для товара 32', 'Параметр 2 для товара 32'),
(33, 'Карандаш 33', 169, 'Параметр 1 для товара 33', 'Параметр 2 для товара 33'),
(34, 'Карандаш 34', 3, 'Параметр 1 для товара 34', 'Параметр 2 для товара 34'),
(35, 'Карандаш 35', 971, 'Параметр 1 для товара 35', 'Параметр 2 для товара 35'),
(36, 'Карандаш 36', 571, 'Параметр 1 для товара 36', 'Параметр 2 для товара 36'),
(37, 'Карандаш 37', 894, 'Параметр 1 для товара 37', 'Параметр 2 для товара 37'),
(38, 'Карандаш 38', 535, 'Параметр 1 для товара 38', 'Параметр 2 для товара 38'),
(39, 'Карандаш 39', 230, 'Параметр 1 для товара 39', 'Параметр 2 для товара 39'),
(40, 'Карандаш 40', 828, 'Параметр 1 для товара 40', 'Параметр 2 для товара 40'),
(41, 'Карандаш 41', 741, 'Параметр 1 для товара 41', 'Параметр 2 для товара 41'),
(42, 'Карандаш 42', 479, 'Параметр 1 для товара 42', 'Параметр 2 для товара 42'),
(43, 'Карандаш 43', 408, 'Параметр 1 для товара 43', 'Параметр 2 для товара 43'),
(44, 'Карандаш 44', 357, 'Параметр 1 для товара 44', 'Параметр 2 для товара 44'),
(45, 'Карандаш 45', 181, 'Параметр 1 для товара 45', 'Параметр 2 для товара 45'),
(46, 'Карандаш 46', 928, 'Параметр 1 для товара 46', 'Параметр 2 для товара 46'),
(47, 'Карандаш 47', 726, 'Параметр 1 для товара 47', 'Параметр 2 для товара 47'),
(48, 'Карандаш 48', 1, 'Параметр 1 для товара 48', 'Параметр 2 для товара 48'),
(49, 'Карандаш 49', 180, 'Параметр 1 для товара 49', 'Параметр 2 для товара 49'),
(50, 'Карандаш 50', 477, 'Параметр 1 для товара 50', 'Параметр 2 для товара 50'),
(51, 'Карандаш 51', 900, 'Параметр 1 для товара 51', 'Параметр 2 для товара 51'),
(52, 'Карандаш 52', 104, 'Параметр 1 для товара 52', 'Параметр 2 для товара 52'),
(53, 'Карандаш 53', 210, 'Параметр 1 для товара 53', 'Параметр 2 для товара 53'),
(54, 'Карандаш 54', 220, 'Параметр 1 для товара 54', 'Параметр 2 для товара 54'),
(55, 'Карандаш 55', 151, 'Параметр 1 для товара 55', 'Параметр 2 для товара 55'),
(56, 'Карандаш 56', 510, 'Параметр 1 для товара 56', 'Параметр 2 для товара 56'),
(57, 'Карандаш 57', 237, 'Параметр 1 для товара 57', 'Параметр 2 для товара 57'),
(58, 'Карандаш 58', 750, 'Параметр 1 для товара 58', 'Параметр 2 для товара 58'),
(59, 'Карандаш 59', 197, 'Параметр 1 для товара 59', 'Параметр 2 для товара 59'),
(60, 'Карандаш 60', 562, 'Параметр 1 для товара 60', 'Параметр 2 для товара 60'),
(61, 'Карандаш 61', 731, 'Параметр 1 для товара 61', 'Параметр 2 для товара 61'),
(62, 'Карандаш 62', 160, 'Параметр 1 для товара 62', 'Параметр 2 для товара 62'),
(63, 'Карандаш 63', 256, 'Параметр 1 для товара 63', 'Параметр 2 для товара 63'),
(64, 'Карандаш 64', 104, 'Параметр 1 для товара 64', 'Параметр 2 для товара 64'),
(65, 'Карандаш 65', 660, 'Параметр 1 для товара 65', 'Параметр 2 для товара 65'),
(66, 'Карандаш 66', 45, 'Параметр 1 для товара 66', 'Параметр 2 для товара 66'),
(67, 'Карандаш 67', 48, 'Параметр 1 для товара 67', 'Параметр 2 для товара 67'),
(68, 'Карандаш 68', 480, 'Параметр 1 для товара 68', 'Параметр 2 для товара 68'),
(69, 'Карандаш 69', 494, 'Параметр 1 для товара 69', 'Параметр 2 для товара 69'),
(70, 'Карандаш 70', 499, 'Параметр 1 для товара 70', 'Параметр 2 для товара 70'),
(71, 'Ручка.30 71', 114, 'Параметр 1 для товара 71', 'Параметр 2 для товара 71'),
(72, 'Ручка.30 72', 77, 'Параметр 1 для товара 72', 'Параметр 2 для товара 72'),
(73, 'Ручка.30 73', 547, 'Параметр 1 для товара 73', 'Параметр 2 для товара 73'),
(74, 'Ручка.30 74', 507, 'Параметр 1 для товара 74', 'Параметр 2 для товара 74'),
(75, 'Ручка.30 75', 59, 'Параметр 1 для товара 75', 'Параметр 2 для товара 75'),
(76, 'Ручка.30 76', 862, 'Параметр 1 для товара 76', 'Параметр 2 для товара 76'),
(77, 'Ручка.30 77', 678, 'Параметр 1 для товара 77', 'Параметр 2 для товара 77'),
(78, 'Ручка.30 78', 123, 'Параметр 1 для товара 78', 'Параметр 2 для товара 78'),
(79, 'Ручка.30 79', 275, 'Параметр 1 для товара 79', 'Параметр 2 для товара 79'),
(80, 'Ручка.30 80', 239, 'Параметр 1 для товара 80', 'Параметр 2 для товара 80'),
(81, 'Ручка.30 81', 315, 'Параметр 1 для товара 81', 'Параметр 2 для товара 81'),
(82, 'Ручка.30 82', 878, 'Параметр 1 для товара 82', 'Параметр 2 для товара 82'),
(83, 'Ручка.30 83', 606, 'Параметр 1 для товара 83', 'Параметр 2 для товара 83'),
(84, 'Ручка.30 84', 177, 'Параметр 1 для товара 84', 'Параметр 2 для товара 84'),
(85, 'Ручка.30 85', 52, 'Параметр 1 для товара 85', 'Параметр 2 для товара 85'),
(86, 'Ручка.30 86', 490, 'Параметр 1 для товара 86', 'Параметр 2 для товара 86'),
(87, 'Ручка.30 87', 397, 'Параметр 1 для товара 87', 'Параметр 2 для товара 87'),
(88, 'Ручка.30 88', 143, 'Параметр 1 для товара 88', 'Параметр 2 для товара 88'),
(89, 'Ручка.30 89', 982, 'Параметр 1 для товара 89', 'Параметр 2 для товара 89'),
(90, 'Ручка.30 90', 179, 'Параметр 1 для товара 90', 'Параметр 2 для товара 90'),
(91, 'Ручка.30 91', 490, 'Параметр 1 для товара 91', 'Параметр 2 для товара 91'),
(92, 'Ручка.30 92', 108, 'Параметр 1 для товара 92', 'Параметр 2 для товара 92'),
(93, 'Ручка.30 93', 699, 'Параметр 1 для товара 93', 'Параметр 2 для товара 93'),
(94, 'Ручка.30 94', 662, 'Параметр 1 для товара 94', 'Параметр 2 для товара 94'),
(95, 'Ручка.30 95', 230, 'Параметр 1 для товара 95', 'Параметр 2 для товара 95'),
(96, 'Ручка.30 96', 539, 'Параметр 1 для товара 96', 'Параметр 2 для товара 96'),
(97, 'Ручка.30 97', 297, 'Параметр 1 для товара 97', 'Параметр 2 для товара 97'),
(98, 'Ручка.30 98', 159, 'Параметр 1 для товара 98', 'Параметр 2 для товара 98'),
(99, 'Ручка.30 99', 459, 'Параметр 1 для товара 99', 'Параметр 2 для товара 99'),
(100, 'Ручка.30 100', 407, 'Параметр 1 для товара 100', 'Параметр 2 для товара 100'),
(101, 'Ручка.30 101', 370, 'Параметр 1 для товара 101', 'Параметр 2 для товара 101'),
(102, 'Ручка.30 102', 388, 'Параметр 1 для товара 102', 'Параметр 2 для товара 102'),
(103, 'Ручка.30 103', 523, 'Параметр 1 для товара 103', 'Параметр 2 для товара 103'),
(104, 'Ручка.30 104', 178, 'Параметр 1 для товара 104', 'Параметр 2 для товара 104'),
(105, 'Ручка.30 105', 11, 'Параметр 1 для товара 105', 'Параметр 2 для товара 105'),
(106, 'Ручка.30 106', 569, 'Параметр 1 для товара 106', 'Параметр 2 для товара 106'),
(107, 'Ручка.30 107', 265, 'Параметр 1 для товара 107', 'Параметр 2 для товара 107'),
(108, 'Ручка.30 108', 822, 'Параметр 1 для товара 108', 'Параметр 2 для товара 108'),
(109, 'Ручка.30 109', 814, 'Параметр 1 для товара 109', 'Параметр 2 для товара 109'),
(110, 'Ручка.30 110', 419, 'Параметр 1 для товара 110', 'Параметр 2 для товара 110'),
(111, 'Ручка.30 111', 28, 'Параметр 1 для товара 111', 'Параметр 2 для товара 111'),
(112, 'Ручка.30 112', 809, 'Параметр 1 для товара 112', 'Параметр 2 для товара 112'),
(113, 'Ручка.30 113', 873, 'Параметр 1 для товара 113', 'Параметр 2 для товара 113'),
(114, 'Ручка.30 114', 158, 'Параметр 1 для товара 114', 'Параметр 2 для товара 114'),
(115, 'Ручка.30 115', 656, 'Параметр 1 для товара 115', 'Параметр 2 для товара 115'),
(116, 'Ручка.30 116', 105, 'Параметр 1 для товара 116', 'Параметр 2 для товара 116'),
(117, 'Ручка.30 117', 781, 'Параметр 1 для товара 117', 'Параметр 2 для товара 117'),
(118, 'Ручка.30 118', 505, 'Параметр 1 для товара 118', 'Параметр 2 для товара 118'),
(119, 'Ручка.30 119', 494, 'Параметр 1 для товара 119', 'Параметр 2 для товара 119'),
(120, 'Ручка.30 120', 181, 'Параметр 1 для товара 120', 'Параметр 2 для товара 120'),
(121, 'Ластик 121', 633, 'Параметр 1 для товара 121', 'Параметр 2 для товара 121'),
(122, 'Ластик 122', 678, 'Параметр 1 для товара 122', 'Параметр 2 для товара 122'),
(123, 'Ластик 123', 384, 'Параметр 1 для товара 123', 'Параметр 2 для товара 123'),
(124, 'Ластик 124', 5, 'Параметр 1 для товара 124', 'Параметр 2 для товара 124'),
(125, 'Ластик 125', 22, 'Параметр 1 для товара 125', 'Параметр 2 для товара 125'),
(126, 'Ластик 126', 395, 'Параметр 1 для товара 126', 'Параметр 2 для товара 126'),
(127, 'Ластик 127', 670, 'Параметр 1 для товара 127', 'Параметр 2 для товара 127'),
(128, 'Ластик 128', 46, 'Параметр 1 для товара 128', 'Параметр 2 для товара 128'),
(129, 'Ластик 129', 42, 'Параметр 1 для товара 129', 'Параметр 2 для товара 129'),
(130, 'Ластик 130', 877, 'Параметр 1 для товара 130', 'Параметр 2 для товара 130');

-- --------------------------------------------------------

--
-- Структура таблицы `prod_items`
--

CREATE TABLE `prod_items` (
  `id_item` int(11) NOT NULL,
  `id_cart` int(11) NOT NULL,
  `id_prod` int(11) NOT NULL,
  `count` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `prod_items`
--

INSERT INTO `prod_items` (`id_item`, `id_cart`, `id_prod`, `count`) VALUES
(23, 7, 1, 2),
(24, 7, 3, 2),
(26, 9, 1, 1),
(27, 9, 21, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id_u` int(11) NOT NULL,
  `ip` int(11) NOT NULL,
  `cookie1` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id_u`, `ip`, `cookie1`) VALUES
(1, 0, NULL),
(2, -1062731605, NULL),
(3, -1062731455, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id_cart`),
  ADD KEY `ind1` (`id_user`);

--
-- Индексы таблицы `catalog`
--
ALTER TABLE `catalog`
  ADD PRIMARY KEY (`id_c`);

--
-- Индексы таблицы `prod_items`
--
ALTER TABLE `prod_items`
  ADD PRIMARY KEY (`id_item`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id_u`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cart`
--
ALTER TABLE `cart`
  MODIFY `id_cart` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT для таблицы `catalog`
--
ALTER TABLE `catalog`
  MODIFY `id_c` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=131;
--
-- AUTO_INCREMENT для таблицы `prod_items`
--
ALTER TABLE `prod_items`
  MODIFY `id_item` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id_u` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
